:PROPERTIES:
:ID:       d80ede15-1396-497e-888d-7d41368e8e17
:END:
#+title: Exercism track: Bash
#+date: "2021-05-11 15:06:43 +08:00"
#+date_modified: "2021-05-19 17:55:11 +08:00"
#+language: en
#+source: https://exercism.io/my/tracks/bash
#+property: header-args  :cache yes
#+property: header-args:bash  :shebang "#/usr/bin/env bash"


These are my submitted solutions for the Bash track in Exercism.
The document structure here is quite simple.
Each problem is its own header with the question and solution properly separated with its own subsection.




** Solution
:PROPERTIES:
:ID:       e1446dd8-2392-4976-b5b2-4b00fd804928
:END:

I interpreted the comments and created a function out of it without realizing the "raw" script is completely fine.
Whoops!

#+begin_src bash  :tangle (my/concat-assets-folder "hello-world.sh")
main() {
  echo "Hello, World!"
}

main
#+end_src

#+results[9110ed5ee1cd74dc35880e0e285e44fc1f04e858]:
: Hello, World!




